### Load modules

In [1]:
import os
import pandas as pd
import numpy as np

#### Read the csv into a dataframe

In [2]:
# read in the data to a pandas dataframe
q2 = pd.read_csv ('Q2\\q2.csv')
q3 = pd.read_csv ('Q3\\q3.csv')
q4 = pd.read_csv ('Q4\\q4.csv')

### Create functions

#### Creat a function to identify NaNs and unique values

In [3]:



def unique_val(df):
    '''Get the unique values of each column'''

    uniq_values = []
    values = []
    feature = []
    is_NaN = []  # Initialize a list to store whether NaN values are present
    
    index_value_tuples = list(df.nunique().items())
    for index, value in index_value_tuples:
        feature.append(index)
        uniq_values.append(value)
        
        # Replace "nan" with actual NaN values in the unique values list
        unique_vals = df[index].unique()
        unique_vals = [np.nan if val == 'nan' else val for val in unique_vals]
        values.append(unique_vals)
        
        # Check if there are NaN values in unique_vals
        if any(pd.isna(unique_vals)):
            is_NaN.append('Yes')
        else:
            is_NaN.append('No')
        
    # Create a DataFrame to store the feature types
    df_out = pd.DataFrame({'Feature': feature,
                           'Unique_values': uniq_values,
                           'is_NaN': is_NaN,
                           'Values': values})
    return df_out

In [4]:
unique_val(q2)

,Feature,Unique_values,is_NaN,Values
0,01 - Rental Details Rental ID,1108163,No,"[22178529, 22178530, 22178531, 22178532, 22178..."
1,01 - Rental Details Local Start Time,957330,No,"[2019-04-01 00:02:22, 2019-04-01 00:03:02, 201..."
2,01 - Rental Details Local End Time,922638,No,"[2019-04-01 00:09:48, 2019-04-01 00:20:30, 201..."
3,01 - Rental Details Bike ID,5764,No,"[6251, 6226, 5649, 4151, 3270, 3123, 6418, 451..."
4,01 - Rental Details Duration In Seconds Uncapped,13769,No,"[446.0, 1,048.0, 252.0, 357.0, 1,007.0, 257.0,..."
5,03 - Rental Start Station ID,610,No,"[81, 317, 283, 26, 202, 420, 503, 260, 211, 30..."
6,03 - Rental Start Station Name,610,No,"[Daley Center Plaza, Wood St & Taylor St, LaSa..."
7,02 - Rental End Station ID,612,No,"[56, 59, 174, 133, 129, 426, 500, 499, 211, 23..."
8,02 - Rental End Station Name,612,No,"[Desplaines St & Kinzie St, Wabash Ave & Roose..."
9,User Type,2,No,"[Subscriber, Customer]"
10,Member Gender,2,Yes,"[Male, Female, nan]"
11,05 - Member Details Member Birthday Year,84,Yes,"[1975.0, 1984.0, 1990.0, 1993.0, 1992.0, 1999...."

In [5]:
unique_val(q3)

,Feature,Unique_values,is_NaN,Values
0,trip_id,1640718,No,"[23479388, 23479389, 23479390, 23479391, 23479..."
1,start_time,1372358,No,"[2019-07-01 00:00:27, 2019-07-01 00:01:16, 201..."
2,end_time,1344539,No,"[2019-07-01 00:20:41, 2019-07-01 00:18:44, 201..."
3,bikeid,5787,No,"[3591, 5353, 6180, 5540, 6014, 4941, 3770, 544..."
4,tripduration,16676,No,"[1,214.0, 1,048.0, 1,554.0, 1,503.0, 1,213.0, ..."
5,from_station_id,612,No,"[117, 381, 313, 168, 300, 43, 511, 24, 624, 23..."
6,from_station_name,612,No,"[Wilton Ave & Belmont Ave, Western Ave & Monro..."
7,to_station_id,613,No,"[497, 203, 144, 62, 232, 195, 84, 24, 43, 237,..."
8,to_station_name,613,No,"[Kimball Ave & Belmont Ave, Western Ave & 21st..."
9,usertype,2,No,"[Subscriber, Customer]"
10,gender,2,Yes,"[Male, nan, Female]"
11,birthyear,86,Yes,"[1992.0, nan, 1990.0, 1995.0, 1970.0, 1993.0, ..."

In [6]:
unique_val(q4)

,Feature,Unique_values,is_NaN,Values
0,trip_id,704054,No,"[25223640, 25223641, 25223642, 25223643, 25223..."
1,start_time,633380,No,"[2019-10-01 00:01:39, 2019-10-01 00:02:16, 201..."
2,end_time,632834,No,"[2019-10-01 00:17:20, 2019-10-01 00:06:34, 201..."
3,bikeid,5670,No,"[2215, 6328, 3003, 3275, 5294, 1891, 1061, 127..."
4,tripduration,10401,No,"[940.0, 258.0, 850.0, 2,350.0, 1,867.0, 373.0,..."
5,from_station_id,610,No,"[20, 19, 84, 313, 210, 156, 336, 77, 198, 66, ..."
6,from_station_name,610,No,"[Sheffield Ave & Kingsbury St, Throop (Loomis)..."
7,to_station_id,608,No,"[309, 241, 199, 290, 382, 226, 142, 463, 336, ..."
8,to_station_name,608,No,"[Leavitt St & Armitage Ave, Morgan St & Polk S..."
9,usertype,2,No,"[Subscriber, Customer]"
10,gender,2,Yes,"[Male, Female, nan]"
11,birthyear,77,Yes,"[1987.0, 1998.0, 1991.0, 1990.0, 1994.0, 1995...."

#### Make the headers Uniform and load the data as a single frame

In [7]:
#use the header of q3 for q2
for i in range(len(q2.columns)):
    q2 = q2.rename(columns={q2.columns[i]: q3.columns[i]})
    q4 = q4.rename(columns={q4.columns[i]: q3.columns[i]})

In [8]:
# concatenate the files vertically
files = [q2,q3,q4]
df = pd.concat(files, ignore_index=True)

#### Confirm we do not have columns name in the row

In [9]:
#check if the header apperars in the dataframe values
df[df['start_time']== 'start_time']

Empty DataFrame
Columns: [trip_id, start_time, end_time, bikeid, tripduration, from_station_id, from_station_name, to_station_id, to_station_name, usertype, gender, birthyear]
Index: []

### Check Data Types and Create a function to check data type

In [10]:
df.dtypes

trip_id                int64
start_time            object
end_time              object
bikeid                 int64
tripduration          object
from_station_id        int64
from_station_name     object
to_station_id          int64
to_station_name       object
usertype              object
gender                object
birthyear            float64
dtype: object

In [11]:
from pandas.api.types import is_numeric_dtype

def featureType(df):
    # Get the column names and the number of rows in the DataFrame
    columns = df.columns
    rows = len(df)
    
    # Initialize empty lists to store the base feature types and analysis feature types
    colTypeBase = []
    colType = []
    
    # Iterate over each column in the DataFrame
    for col in columns:
        try:
            uniq = df[col].nunique()
            
            # Check if the number of rows is greater than 10
            if rows > 10:
                if is_numeric_dtype(df[col]):
                    # Numeric columns
                    if uniq == 1:
                        colType.append('Unary')
                        colTypeBase.append('Unary')
                    elif uniq == 2:
                        colType.append('Binary')
                        colTypeBase.append('Binary')
                    elif rows / uniq > 3 and uniq > 5:
                        colType.append('Continuous')
                        colTypeBase.append('Continuous')
                    else:
                        colType.append('Continuous-Ordinal')
                        colTypeBase.append('Ordinal')
                else:
                    # Categorical columns
                    if uniq == 1:
                        colType.append('Unary')
                        colTypeBase.append('Category-Unary')
                    elif uniq == 2:
                        colType.append('Binary')
                        colTypeBase.append('Category-Binary')
                    else:
                        colType.append('Categorical-Nominal')
                        colTypeBase.append('Nominal')
            else:
                # For small datasets, simply classify columns as numeric or non-numeric
                if is_numeric_dtype(df[col]):
                    colType.append('Numeric')
                    colTypeBase.append('Numeric')
                else:
                    colType.append('Non-numeric')
                    colTypeBase.append('Non-numeric')
        except:
            colType.append('Issue')
    
    # Create a DataFrame to store the feature types
    df_out = pd.DataFrame({'Feature': columns,
                           'BaseFeatureType': colTypeBase,
                           'AnalysisFeatureType': colType})
    return df_out

#### Check for the data types

In [12]:
#check the output
featureType(df)

              Feature  BaseFeatureType  AnalysisFeatureType
0             trip_id          Ordinal   Continuous-Ordinal
1          start_time          Nominal  Categorical-Nominal
2            end_time          Nominal  Categorical-Nominal
3              bikeid       Continuous           Continuous
4        tripduration          Nominal  Categorical-Nominal
5     from_station_id       Continuous           Continuous
6   from_station_name          Nominal  Categorical-Nominal
7       to_station_id       Continuous           Continuous
8     to_station_name          Nominal  Categorical-Nominal
9            usertype  Category-Binary               Binary
10             gender  Category-Binary               Binary
11          birthyear       Continuous           Continuous

#### Convert to appropriate Data Type

In [13]:
# Convert start_time and end_time to datetime objects
df['start_time'] = pd.to_datetime(df['start_time'])
df['end_time'] = pd.to_datetime(df['end_time'])
df['start_day'] = df['start_time'].dt.hour.apply(lambda x: 'morning' if 5 <= x < 12 else ('afternoon' if 12 <= x < 17 else 'evening'))
df['end_day'] = df['end_time'].dt.hour.apply(lambda x: 'morning' if 5 <= x < 12 else ('afternoon' if 12 <= x < 17 else 'evening'))


# Change the data types and create a new column for time of the day
df['bikeid'] = df['bikeid'].astype(str)
df['tripduration'] = df['tripduration'].str.replace(',', '').astype(float)
df['from_station_id'] = df['from_station_id'].astype(str)
df['to_station_id'] = df['to_station_id'].astype(str)
df['birthyear'] = pd.to_numeric(df['birthyear'], errors='coerce')

# Calculate age based on the reference year (2022)
ref_year = 2022
df['age'] = ref_year - df['birthyear']

In [14]:
df.dtypes

trip_id                       int64
start_time           datetime64[ns]
end_time             datetime64[ns]
bikeid                       object
tripduration                float64
from_station_id              object
from_station_name            object
to_station_id                object
to_station_name              object
usertype                     object
gender                       object
birthyear                   float64
start_day                    object
end_day                      object
age                         float64
dtype: object

#### Concateneate "from_station_id" + "to_station_id" to have a category of movements pattern

In [15]:
# Concatenate the columns using str.cat()
df['from-to'] = df['from_station_id'].str.cat(df['to_station_id'], sep='-')

In [16]:
data = df[["bikeid","start_day","end_day","from-to","age","gender","usertype","tripduration"]]
data

,bikeid,start_day,end_day,from-to,age,gender,usertype,tripduration
0,6251,evening,evening,81-56,47.0,Male,Subscriber,446.0
1,6226,evening,evening,317-59,38.0,Female,Subscriber,1048.0
2,5649,evening,evening,283-174,32.0,Male,Subscriber,252.0
3,4151,evening,evening,26-133,29.0,Male,Subscriber,357.0
4,3270,evening,evening,202-129,30.0,Male,Subscriber,1007.0
...,...,...,...,...,...,...,...,...
3452930,2196,evening,evening,112-225,41.0,Male,Subscriber,1172.0
3452931,4877,evening,evening,90-90,30.0,Male,Subscriber,1533.0
3452932,863,evening,evening,623-52,55.0,Male,Subscriber,520.0
3452933,2637,evening,evening,623-52,52.0,Female,Subscriber,514.0
3452934,5930,evening,evening,256-240,40.0,Male,Subscriber,120.0

In [17]:
data.dtypes

bikeid           object
start_day        object
end_day          object
from-to          object
age             float64
gender           object
usertype         object
tripduration    float64
dtype: object

In [19]:
#Check the data type
featureType(data)

        Feature  BaseFeatureType  AnalysisFeatureType
0        bikeid          Nominal  Categorical-Nominal
1     start_day          Nominal  Categorical-Nominal
2       end_day          Nominal  Categorical-Nominal
3       from-to          Nominal  Categorical-Nominal
4           age       Continuous           Continuous
5        gender  Category-Binary               Binary
6      usertype  Category-Binary               Binary
7  tripduration       Continuous           Continuous

### Fix NaN
##### from the unique value function we see "Gender", and "age" having NaN

In [23]:
data

,bikeid,start_day,end_day,from-to,age,gender,usertype,tripduration
0,6251,evening,evening,81-56,47.0,Male,Subscriber,446.0
1,6226,evening,evening,317-59,38.0,Female,Subscriber,1048.0
2,5649,evening,evening,283-174,32.0,Male,Subscriber,252.0
3,4151,evening,evening,26-133,29.0,Male,Subscriber,357.0
4,3270,evening,evening,202-129,30.0,Male,Subscriber,1007.0
...,...,...,...,...,...,...,...,...
3452930,2196,evening,evening,112-225,41.0,Male,Subscriber,1172.0
3452931,4877,evening,evening,90-90,30.0,Male,Subscriber,1533.0
3452932,863,evening,evening,623-52,55.0,Male,Subscriber,520.0
3452933,2637,evening,evening,623-52,52.0,Female,Subscriber,514.0
3452934,5930,evening,evening,256-240,40.0,Male,Subscriber,120.0

In [21]:
data.gender.unique()

array(['Male', 'Female', nan], dtype=object)

In [ ]:
data['gender'] = data.gender.replace(np.nan, "NaN")

In [ ]:
data['age'] = data.age.replace(np.nan, "NaN")

In [42]:
data.isna().sum()

bikeid          0
start_day       0
end_day         0
from-to         0
age             0
gender          0
usertype        0
tripduration    0
dtype: int64

In [44]:
data.start_day.value_counts()

evening      1278148
afternoon    1125291
morning      1049496
Name: start_day, dtype: int64